word = 'aob' //задаем слово
alf = ['a', 'o', 'b'] //создаем алфавит
a = ["  *   ", " * *  ", " **** ", "*    *", "*    *"] //создаем буквы
b = ["*     ","*     ","******","*    *", "******"]
o = [" **** ", "*    *", "*    *", "*    *", " **** "]

mat = [a, o, b] //создаем матрицу
ch = [alf.index(x) for x in list(word)]  //находим какой индекс в списке alf соотносится с каждой буквой

//печатаем буквы

for i in range(len(mat[0])):
    for j in range(len(ch)):
        //выводим первые элементы списков букв,перевод строки, затем вторые элементы и так далее
        print(mat[ch[j]][i], end = '  ')
    print()
