def sistch():
    p = int(input(f"p="))
    np = int(input(f"N{p}="))
    k = int(1)
    N10 = int(0)
    while not np == 0:
        N10 = N10 + (np % 10) * k
        k = k * p
        np = np // 10
    print(f"N10 = {N10}")
    print('Готово!')
def sistchh():
    N10 = int(input('Введите исходное 10-тичное число: '))
    p = 1
    while ((p<2) or (p>9)):
        p = int(input('Введите основание системы счисления в диапазоне [2; 9]: '))
    k = int(1)
    Np = int(0)
    while not (N10 == 0):
        Np = Np + (N10 % p)*k
        k = k*10
        N10 = N10 // p
    print('N' + str(p) + ' = ' + str(Np))
def morz():
    A = list('АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ')
    a = list('абвгдежзийклмнопрстуфхцчшщъыьэюя')  
    Morze = list([".-","-...",".--","--.","-..",".","...-","--..","..",".---","-.-",".-..","--","-","---",".--.",".-.","...","-","..-","..-.","....","-.-.","---.","----","--.-",".--.-","-.--","-..-","..-..","..--",".-.-"])
    InpS = input('Введите исходную строку: ')
    OutS = str('')
    for i in range(1, (len(InpS)+1)):
        for j in range (1, 32):
            if (InpS[i-1] == str(A[j-1])) or (InpS[i-1] == str(a[j-1])):
                OutS = OutS + str(Morze[j-1]) + ' '
    print('Ваша строка, перекодированная на азбуку Морзе: ' +OutS)
vchod = int(input("Задачи: /n 1) перевод в 10-ую систему счиления /n 2) перевод из 10-ой системы счисления /n 3) перевод слова с помощью азбуки морзе /n 4) ")
