def info():
    ch = 0
    while ch != 5:
        dano = int(input("Выберите, что дано: \n1) N - мощность алфавита \n2) K - количество символов \n3) I - информационный объем текста \n4) i - информационнй объем одного символа \n5) готово"))
        if dano == 1:
            N = int(input())
        if dano == 2:
            K = int(input())
        if dano == 3:
            I = int(input())
        if dano == 4:
            i = int(input())



zadacha = int(input("Выберите тип задачи: \n1) задачи на кодирование информации \n2) задачи на кодирование звука \n3) задачи на кодирование изображение. Выбор: "))
if zadacha == 1
    info()